app/views/gossips/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    <p class="card-text">  <%=  @id_gossips.created_at %><br></p>
    <p  class="btn btn btn-primary"><%= link_to "#{@id_gossips.user.first_name}", user_path(@id_gossips.user.id) %> </p>