app/views/pages/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    <p class="card-text">  <%=  @id_gossips.created_at %><br></p>
    <a  href="/user/<%= @id_gossips.user_id %>"  class="btn btn btn-primary"><%=  @id_gossips.user.first_name %></a>