app/views/pages/welcome.html.erb


          <td><%= gossip.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]