app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
    def index
      @name = params[:first_name]
      @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
      @gossips = Gossip.all
      @id_gossips = Gossip.find(params['id'])

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def new
      @gossip = Gossip.last

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "azdazdazd"], ["content", "azdazdazd"], ["user_id", 21], ["created_at", "2019-02-05 22:18:15.673748"], ["updated_at", "2019-02-05 22:18:15.673748"]]
---
    def create
      # Méthode qui créé un potin à partir du contenu du formulaire de new.html.erb, soumis par l'utilisateur
      # pour info, le contenu de ce formulaire sera accessible dans le hash params (ton meilleur pote)
      # Une fois la création faite, on redirige généralement vers la méthode show (pour afficher le potin créé)

      @gossip = Gossip.new
      @gossip.title = params['gossip_title']
      @gossip.content = params['gossip_content']
      @gossip.user = User.last

      if @gossip.save # essaie de sauvegarder en base @gossip